# Вправа 1: Проста математика
print("\n=== ВПРАВА 1: Калькулятор ===")
print("Створіть простий калькулятор для двох чисел і двох дій")
print("Підтримувані операції: +, -")

# Початок реалізації:
num1 = float(input("Введіть перше число: "))
operation = input("Введіть операцію (+, -, ): ")
num2 = float(input("Введіть друге число: "))
result=None
if operation== "+":
    result=num1+num2
elif operation=="-":
    result=num1-num2
else:
    result=None

if result is None:
    print("Введена операція була невірною")
else:
    print(f"{num1} {operation} {num2} = {result}")
# Вправа 2: Перевірка паролю
print("\n=== ВПРАВА 2: Перевірка паролю ===")
print("Створіть систему перевірки паролю")
print("Пароль повинен містити принаймні 8 символів")
password=input("Введіть пароль. Пароль має містити щонайменше 8 символів ")
if len(password)<8:
    print("Невірний пароль Пароль має містити щонайменше 8 символів")
else:
    print("Пароль введено вірно")


# Вправа 3: Визначення високосного року
print("\n=== ВПРАВА 3: Високосний рік ===")
print("Рік є високосним, якщо:")
print("- Ділиться на 4 І не ділиться на 100")
print("- АБО ділиться на 400")
year=int(input("Введіть рік "))
if((year%4==0 and year%100 !=0) or year%400==0):
    print("Високосний рік")
else:
    print("Не високосний рік")

# Вправа 4: Лічильник голосних
print("\n=== ВПРАВА 4: Лічильник голосних ===")
print("Підрахуйте кількість голосних у рядку")

text = input("Введіть текст: ").lower()
vowels = "аеиіїоуюя"
count = sum(text.count(v) for v in vowels)

# код тут

print(f"Кількість голосних: {count}")


# Вправа 5: Гра 
print("\n=== ВПРАВА 5: Гра ===")
"""
Уявіть, що інопланетянина з кольором alien_color щойно збили в грі.
Створіть змінну під назвою alien_color і призначте їй значення 'green', 'yellow', або 'red'.
Напишіть оператор if, щоб перевірити, чи колір прибульця 'green'.
Якщо колір прибульця green, надрукуйте, що гравець щойно заробив 5 балів.
Якщо колір прибульця yellow, надрукуйте, що гравець щойно заробив 10 балів.
Якщо колір прибульця red - надрукуйте, що гравець щойно заробив 15 балів.
Перевірте роботу гри самостійно, змінюючи значення alien_color
"""
alien_color = "green"
if alien_color == "green":
    print("Гравець щойно заробив 5 балів!")
elif alien_color == "yellow":
    print("Гравець щойно заробив 10 балів!")
elif alien_color == "red":
    print("Гравець щойно заробив 15 балів!")
else:
    print("Прибулець вказаного кольору ще в дорозі")


# Вправа 6: Піцерія *
print("\n=== ВПРАВА 6: Начинки для піци (pizza_topping) ===")
"""  Начинки для піци (pizza_topping): напишіть цикл, який пропонує користувачеві ввести ряд начинок
для піци, доки він не введе значення 'quit'. Коли вони введуть кожну начинку,
надрукуйте повідомлення про те, що ви додасте цю начинку до їхньої піци.
"""
while True:
    ingridient=input("Введіть назву начинки: ")
    if ingridient=="quit":
        break
    print(f"Ми додамо {ingridient} до Вашої піци")



# Вправа 7: Зворотний порядок цифр
print("\n=== ВПРАВА 7: Зворотний порядок ===")
print("Виведіть цифри числа у зворотному порядку")
number=input("Введіть число: ")
reversed_number=number[::-1]
print(f"Чмсло у зворотному порядку: {reversed_number}")


# Вправа 8: Пошук максимального числа
print("\n=== ВПРАВА 8: Пошук максимального ===")
print("Знайдіть найбільше число серед введених")
print("Введіть 0 для завершення")
numbers = []
while True:
    number = int(input("Введіть число (0 для завершення): "))
    if number == 0:
        break
    numbers.append(number)

if numbers:
    print(f"Найбільше введене число: {max(numbers)}")

# Вправа 9: Виключення зі списку
print("\n=== ВПРАВА 9: Виключення зі списку ===")
"""  Задача з використанням циклу for та continue. Задано список фруктів 'fruits'
потрібно вивести на екран всі елементи списку, окрім "orange".
"""
fruits = ["apple", "banana", "orange", "grape", "mango"]
for fruit in fruits:
    if fruit == "orange":
        continue
    print(f"Фрукт: {fruit}")

# Вправа 10: Вираз в один рядок
print("\n=== ВПРАВА 10: Вираз з умовою в один рядок ===")
"""  Задано список чисел numbers, потрібно знайти список квадратів
парних чисел зі списку. Спробуйте використати if та цикл for в один рядок.
"""
numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
result = [num**2 for num in numbers if num % 2 == 0]

print(result)  #  [4, 16, 36, 64, 100]